src/test/resources/cyberarksoapreq.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:tem="https://tempuri.org/">
   <soap:Header/>
   <soap:Body>
      <tem:GetPassword>
         <tem:passwordWSRequest>
            <tem:AppID>WMS_TEST</tem:AppID>
            <tem:Safe>PSV-FS-WMS-AutoTest-G</tem:Safe>
            <tem:Object>Misc-Macys-Application-Passive-jirawms</tem:Object>
            <tem:Object>Database-Macys-Passive-OracleDatabase-LFNDQA-MNETQA</tem:Object>
         </tem:passwordWSRequest>
      </tem:GetPassword>
   </soap:Body>
</soap:Envelope>