src/test/resources/cyberarksoapreq.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:tem="https://tempuri.org/">
   <soap:Header/>
   <soap:Body>
      <tem:GetPassword>
         <tem:passwordWSRequest>
            <tem:AppID>TBD</tem:AppID>
            <tem:Safe>TBD</tem:Safe>
            <tem:Object/>
         </tem:passwordWSRequest>
      </tem:GetPassword>
   </soap:Body>
</soap:Envelope>